---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Field.Documentation
source: html/d395238f-798d-0d01-36dc-4a022f50e8a7.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Field.Documentation Property

The overall description of the Field.

## Syntax (C#)
```csharp
public string Documentation { get; }
```